### Deployment Results - Production 🪐
- Deployment 🚀: `failure`

<details><summary>Show Apply</summary>

```terraform cloudflare_record.manager: Refreshing state... [id=2e208b66455795c12afd59021c56d891]
cloudflare_rate_limit.tarkov_dev: Refreshing state... [id=c17da00a5a7b435680c638b26bf6cc5c]
cloudflare_record.market: Refreshing state... [id=c0e350a380953cdff74f16c911b3c595]
cloudflare_record.socket: Refreshing state... [id=98b363905c2efdf7a730dc754d7a680f]
cloudflare_record.status: Refreshing state... [id=8b78ff4373eb3ed0fedc73ee511c4168]
cloudflare_record.api: Refreshing state... [id=5a6f0c44f89893d479067808915a429f]
cloudflare_record.www: Refreshing state... [id=c9b09dbb4885589e1d7a7ed17f0b7bc8]
cloudflare_record.root: Refreshing state... [id=58772b98e3e902db650041cbe2262633]
cloudflare_zone.tarkov_dev: Refreshing state... [id=a17204c79af55fcf05e4975f66e2490e]
cloudflare_zone_settings_override.tarkov_dev: Refreshing state... [id=a17204c79af55fcf05e4975f66e2490e]
cloudflare_record.assets: Refreshing state... [id=fa9d45fc579f68883bce2b2e2bf4e378]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # cloudflare_record.api has changed
  ~ resource "cloudflare_record" "api" {
        id          = "5a6f0c44f89893d479067808915a429f"
      ~ modified_on = "2022-03-20T23:46:39.59752Z" -> "2022-04-01T17:03:33.023858Z"
        name        = "api"
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # cloudflare_record.api will be updated in-place
  ~ resource "cloudflare_record" "api" {
      + allow_overwrite = false
        id              = "5a6f0c44f89893d479067808915a429f"
        name            = "api"
      ~ value           = "api.hideout-api.workers.dev" -> "tarkov-dev-prod.graphcdn.app"
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # cloudflare_record.dev-api will be created
  + resource "cloudflare_record" "dev-api" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "dev-api"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "tarkov-api-dev.graphcdn.app"
      + zone_id         = "a17204c79af55fcf05e4975f66e2490e"
    }

Plan: 1 to add, 1 to change, 0 to destroy.
cloudflare_record.dev-api: Creating...
cloudflare_record.api: Modifying... [id=5a6f0c44f89893d479067808915a429f]
cloudflare_record.api: Modifications complete after 2s [id=5a6f0c44f89893d479067808915a429f]
cloudflare_record.dev-api: Still creating... [10s elapsed]
cloudflare_record.dev-api: Still creating... [20s elapsed]
cloudflare_record.dev-api: Still creating... [30s elapsed]
```

</details>

Please wait at least 5 minutes after a deployment to validate your changes before merging

> Pusher: @austinhodak, Action: `issue_comment`, Working Directory: `terraform/`, Workflow: `branch-deploy`